README.org
#+TITLE: LDSC-Ajuda-DocumentosAuxiliares

* Informações:
- Repositório com informações para alunos do LENEP/CCT/UENF.

* Organização do repositório
O repositório esta subdividido em subdiretórios com informações para alunos.

├── 01-ProjetoEngenharia-Metodologia-Instrucoes-Etapas
├── 02-Softwares
├── 03-MetodologiaCientifica-DicasEstudo

** ├── 01-ProjetoEngenharia-Metodologia-Instrucoes-Etapas
*** Contem informações sobre a metodologia utilizada para desenvolvimento do projeto de engenharia das disciplinas de modelagem computacional.
** ├── 02-Softwares
*** 01-InstalacaoGnuLinuxFedora
**** Informações diversas sobre software livre e instalação do sistema operacional GNU/Linux/Fedora, o sistema operacional utilizado nas disciplinas.
*** 02-GuiasDeReferencia
**** Inclui diversos guias de referência de comandos de terminal, GNU/Linux, git, UML, C++, entre outros.
*** 03-Softwares
**** Contem manuais e informações de softwares utilizados, incluindo:
**** 01-Gnome
**** 02-Gnuplot
**** 03-LaTeX
**** 04-LyX
.
*** 04-BibliotecasProgramacaoC++
**** Contem manuais e informações de bibliotecas utilizados, incluindo:
**** 01-CGnuplot
**** 02-QCustomPlot
**** 03-Realine
**** 04-Magick++
**** 05-GSL

** ├── 03-MetodologiaCientifica-DicasEstudo
*** Apostilas com dicas de como estudar, como se programar.
.

- 

* Versão: 
- 1.0.

* Data:
- 2024/2 - segundo semestre.
  
* Autor de Contato:
- André Duarte Bueno <andreduartebueno@gmail.com>

* Lista dos Autores:
- ...
- André Duarte Bueno <andreduartebueno@gmail.com>

* Áreas de pesquisa vinculadas: 
- Modelagem Matemática Computacional
- Engenharia de Reservatório
- ...

* Vinculo com: 
- [[https://sites.google.com/view/professorandreduartebueno/ensino/projeto-de-software-aplicado][Trabalho da disciplina Projeto de Software Aplicado à Engenharia]].

* Paradigmas: 
- POO - Programação Orientada a Objeto (códigos em C++)

* Tipo de Interface: 
- Terminal e gráfica (gnuplot).
- Qt?

* Plataformas Suportadas: 
- Windows e GNU/Linux e Mac OS X (não testada).

* Linguagens Utilizadas: 
- C++ 23.

* Bibliotecas Utilizadas (dependências):
- CGnuplot - https://github.com/ldsc/CGnuplot

* Softwares utilizados (dependências)
- gnuplot http://www.gnuplot.info/

* Tipo de Licença:
- GPL
* Novas Versões
- Entre em contato com o Prof. André Duarte Bueno
  andreduartebueno@gmail.com
  para que o mesmo gere um novo projeto no github do ldsc para que você (e sua equipe) possam trabalhar na nova versão.
- Se este projeto tem como número de versão 1.0 a nova versão deverá ser 2.0 e assim sucessivamente.
- Os nomes dos autores originais deve ser preservada na nova versão, ou seja, adicione a informação do número da versão, os nomes dos membros da nova equipe, mas jamais apague os nomes dos autores originais (isto seria plágio).
- Na descrição do projeto informe que trata-se de uma nova versão, que tem como base a versão anterior e DESTAQUE COM CLAREZA E OBJETIVIDADE QUAIS AS NOVIDADES DA NOVA VERSÃO.
  
* Links:
- [[https://sites.google.com/view/professorandreduartebueno/][Site do Professor André Duarte Bueno]].
- [[https://github.com/ldsc][Site do LDSC no github]].
- [[https://uenf.br/cct/lenep][Site do LENEP]].
- .
