README.md

# Table of Contents

1.  [Informações:](#orgf9b26a5)
2.  [Organização do repositório](#org73dba68)
    1.  [├── 01-ProjetoEngenharia-Metodologia-Instrucoes-Etapas](#orge071503)
        1.  [Contem informações sobre a metodologia utilizada para desenvolvimento do projeto de engenharia das disciplinas de modelagem computacional.](#org679ebf8)
    2.  [├── 02-Softwares](#org7fe4cfd)
        1.  [01-InstalacaoGnuLinuxFedora](#org3b7952c)
        2.  [02-GuiasDeReferencia](#orga1befb5)
        3.  [03-Softwares](#org065f2d9)
        4.  [04-BibliotecasProgramacaoC++](#org9c2a227)
    3.  [├── 03-MetodologiaCientifica-DicasEstudo](#org2af9f1e)
        1.  [Apostilas com dicas de como estudar, como se programar.](#org44f8590)
3.  [Versão:](#org4bdb519)
4.  [Data:](#orgb90c5b0)
5.  [Autor de Contato:](#org6d01afc)
6.  [Lista dos Autores:](#org3f44246)
7.  [Áreas de pesquisa vinculadas:](#org5aaab73)
8.  [Vinculo com:](#org36d2835)
9.  [Paradigmas:](#org3ca01a6)
10. [Tipo de Interface:](#orgaa124b8)
11. [Plataformas Suportadas:](#org01f9e38)
12. [Linguagens Utilizadas:](#orgab4ff20)
13. [Bibliotecas Utilizadas (dependências):](#org1f90ee4)
14. [Softwares utilizados (dependências)](#orgeea4cf8)
15. [Tipo de Licença:](#org47ebf4d)
16. [Novas Versões](#org98a576f)
17. [Links:](#org99f8a05)



<a id="orgf9b26a5"></a>

# Informações:

-   Repositório com informações para alunos do LENEP/CCT/UENF.


<a id="org73dba68"></a>

# Organização do repositório

O repositório esta subdividido em subdiretórios com informações para alunos.

├── 01-ProjetoEngenharia-Metodologia-Instrucoes-Etapas
├── 02-Softwares
├── 03-MetodologiaCientifica-DicasEstudo


<a id="orge071503"></a>

## ├── 01-ProjetoEngenharia-Metodologia-Instrucoes-Etapas


<a id="org679ebf8"></a>

### Contem informações sobre a metodologia utilizada para desenvolvimento do projeto de engenharia das disciplinas de modelagem computacional.


<a id="org7fe4cfd"></a>

## ├── 02-Softwares


<a id="org3b7952c"></a>

### 01-InstalacaoGnuLinuxFedora

1.  Informações diversas sobre software livre e instalação do sistema operacional GNU/Linux/Fedora, o sistema operacional utilizado nas disciplinas.


<a id="orga1befb5"></a>

### 02-GuiasDeReferencia

1.  Inclui diversos guias de referência de comandos de terminal, GNU/Linux, git, UML, C++, entre outros.


<a id="org065f2d9"></a>

### 03-Softwares

1.  Contem manuais e informações de softwares utilizados, incluindo:

2.  01-Gnome

3.  02-Gnuplot

4.  03-LaTeX

5.  04-LyX

    .


<a id="org9c2a227"></a>

### 04-BibliotecasProgramacaoC++

1.  Contem manuais e informações de bibliotecas utilizados, incluindo:

2.  01-CGnuplot

3.  02-QCustomPlot

4.  03-Realine

5.  04-Magick++

6.  05-GSL


<a id="org2af9f1e"></a>

## ├── 03-MetodologiaCientifica-DicasEstudo


<a id="org44f8590"></a>

### Apostilas com dicas de como estudar, como se programar.

.

-   


<a id="org4bdb519"></a>

# Versão:

-   1.0.


<a id="orgb90c5b0"></a>

# Data:

-   2024/2 - segundo semestre.


<a id="org6d01afc"></a>

# Autor de Contato:

-   André Duarte Bueno <andreduartebueno@gmail.com>


<a id="org3f44246"></a>

# Lista dos Autores:

-   &#x2026;
-   André Duarte Bueno <andreduartebueno@gmail.com>


<a id="org5aaab73"></a>

# Áreas de pesquisa vinculadas:

-   Modelagem Matemática Computacional
-   Engenharia de Reservatório
-   &#x2026;


<a id="org36d2835"></a>

# Vinculo com:

-   [Trabalho da disciplina Projeto de Software Aplicado à Engenharia](https://sites.google.com/view/professorandreduartebueno/ensino/projeto-de-software-aplicado).


<a id="org3ca01a6"></a>

# Paradigmas:

-   POO - Programação Orientada a Objeto (códigos em C++)


<a id="orgaa124b8"></a>

# Tipo de Interface:

-   Terminal e gráfica (gnuplot).
-   Qt?


<a id="org01f9e38"></a>

# Plataformas Suportadas:

-   Windows e GNU/Linux e Mac OS X (não testada).


<a id="orgab4ff20"></a>

# Linguagens Utilizadas:

-   C++ 23.


<a id="org1f90ee4"></a>

# Bibliotecas Utilizadas (dependências):

-   CGnuplot - <https://github.com/ldsc/CGnuplot>


<a id="orgeea4cf8"></a>

# Softwares utilizados (dependências)

-   gnuplot <http://www.gnuplot.info/>


<a id="org47ebf4d"></a>

# Tipo de Licença:

-   GPL


<a id="org98a576f"></a>

# Novas Versões

-   Entre em contato com o Prof. André Duarte Bueno
    andreduartebueno@gmail.com
    para que o mesmo gere um novo projeto no github do ldsc para que você (e sua equipe) possam trabalhar na nova versão.
-   Se este projeto tem como número de versão 1.0 a nova versão deverá ser 2.0 e assim sucessivamente.
-   Os nomes dos autores originais deve ser preservada na nova versão, ou seja, adicione a informação do número da versão, os nomes dos membros da nova equipe, mas jamais apague os nomes dos autores originais (isto seria plágio).
-   Na descrição do projeto informe que trata-se de uma nova versão, que tem como base a versão anterior e DESTAQUE COM CLAREZA E OBJETIVIDADE QUAIS AS NOVIDADES DA NOVA VERSÃO.


<a id="org99f8a05"></a>

# Links:

-   [Site do Professor André Duarte Bueno](https://sites.google.com/view/professorandreduartebueno/).
-   [Site do LDSC no github](https://github.com/ldsc).
-   [Site do LENEP](https://uenf.br/cct/lenep).
-   .

